from flask import Flask
import random


app = Flask(__name__)


@app.route('/')
def index():
    return '<a href="/random_fact">Посмотреть случайный факт!</a>'


@app.route("/random_fact")
def random_fact():
  facts_list = ["Согласно исследованию, проведенному в 2018 году, более 50% людей в возрасте от 18 до 34 лет считают себя зависимыми от своих смартфонов.",

"Согласно исследованию, проведенному в 2019 году, более 60% людей отвечают на рабочие сообщения в своих смартфонах в течение 15 минут после того, как они вышли с работы.",

'Один из способов борьбы с технологической зависимостью - это поиск занятий, которые приносят удовольствие и улучшают настроение.',

'Илон Маск утверждает, что социальные сети созданы для того, чтобы удерживать нас внутри платформы, чтобы мы тратили как можно больше времени на просмотр контента.']
          
  return f'<p>{random.choice(facts_list)}</p>'

    


app.run(host='0.0.0.0', port=81)
